Revit 2020 API
FormatOptions.GetValidUnitSymbols Method
 Gets all valid unit symbols for the display unit in this FormatOptions.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 20.0.0.0 (20.0.0.377)
Since: 2014
Syntax
C#
public IList<UnitSymbolType> GetValidUnitSymbols()
Visual Basic
Public Function GetValidUnitSymbols As IList(Of UnitSymbolType)
Visual C++
public:
IList<UnitSymbolType>^ GetValidUnitSymbols()
Return Value
 The valid unit symbols.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.InvalidOperationException |  UseDefault is true in this FormatOptions.
See Also
FormatOptions Class
GetValidUnitSymbols Overload
Autodesk.Revit.DB Namespace